DanilovSoft/ShowerSTM32/stm32-shower/ValveTask.h
#pragma once
#include "TaskBase.h"
#include "semphr.h"
#include "stm32f10x_gpio.h"
#include "WaterLevelTask.h"
#include "HeaterTask.h"
#include "FreeRTOS.h"
#include "Interlocked.h"
#include "InitializationTask.h"

class ValveTask final : public TaskBase
{	
public:
    
    void Init()
    {
        // Клапан.
        GPIO_InitTypeDef gpio_init = 
        {
            .GPIO_Pin = Valve_Pin,
            .GPIO_Speed = GPIO_Speed_2MHz,
            .GPIO_Mode = GPIO_Mode_Out_PP
        };
        GPIO_Init(Valve_GPIO, &gpio_init);
        
        // Закрыть клапан.
        GPIO_ResetBits(Valve_GPIO, Valve_Pin);
        
        // Питающий вывод сенсора.
        gpio_init = 
        {
            .GPIO_Pin = SensorSwitch_Power_Pin,
            .GPIO_Speed = GPIO_Speed_2MHz,
            .GPIO_Mode = GPIO_Mode_Out_PP
        };
        GPIO_Init(SensorSwitch_Power_GPIO, &gpio_init);

        // Выключить питание сенсора до окончания инициали датчика уровня воды.
        Common::TurnOffSensorSwitch();

        //m_xValveSemaphore = xSemaphoreCreateBinaryStatic(&m_xValveSemaphoreBuffer);	
    }
    
    // Вызывается каждый раз, после OnButtonPushed().
    void UpdateSensorState(bool isOn)
    {
        if (isOn)
        {
            if (!m_sensorSwitchIsOnLastState)
            {
                m_sensorSwitchIsOnLastState = true;
            
                // Попытка включить воду.
                TryOpenValve();
            }
        }
        else
        {
            if (m_sensorSwitchIsOnLastState)
            {
                m_sensorSwitchIsOnLastState = false;
            
                // Нужно остановить воду.
                m_stopRequired = true;
            }
        }
    }
    
    // Вызывается при нажатии на кнопку.
    void OnButtonPress()
    {
        if (Common::ValveIsOpen())
        {
            // Нужно остановить воду.
            m_stopRequired = true;
        }
        else
        {
            // Попытка включить воду.
            TryOpenValve();
        }
    }

    // Вызывается при долгом нажатии на кнопку.
    void ForceOpenValve()
    {
        if (m_openValveAllowed == ValveTask::WaitingRequest)
        {
            // Запрещаем пользователю повторные запросы.
            m_openValveAllowed = ValveTask::PendingForceOpen;
            
            // Пробуждаем поток.
            xTaskNotifyGive(m_taskHandle);
        }
    }
    
private:
    
    enum ValveState
    {
        WaitingRequest,
        PendingOpen,
        PendingForceOpen
    };
    
    // Пауза для повторного включения клапана.
    static const auto kValveDebounceMsec = 300;
    bool m_sensorSwitchIsOnLastState = false;
    // Флаг прекращающий набор воды по запросу пользователя.
    volatile bool m_stopRequired = false;
    // Флаг предотвращающий повторные запросы на открытие клапана от пользователя,
    // пока другой поток обрабатывает первый запрос (троттлинг).
    volatile ValveState m_openValveAllowed = ValveState::PendingOpen;
    
    // Закрывает клапан.
    // Выключает сенсор и выдерживает небольшую паузу 
    // и опять включает сенсор (так мы сбрасываем его активное состояние).
    // Блокирует поток на время паузы.
    void CloseValve()
    {
        // Закрыть клапан.
        Common::CloseValve();
        
        // Выключить сенсор.
        Common::TurnOffSensorSwitch();
        
        // Выдержать паузу для антидребезга.
        vTaskDelay(kValveDebounceMsec / portTICK_PERIOD_MS);

        // Включить питание сенсора.
        Common::TurnOnSensorSwitch();
    }
    
    void Run()
    {
        g_initializationTask.WaitForPropertiesInitialization();
        
        // Нужно включить флаг перед включением сенсора.
        m_openValveAllowed = ValveTask::WaitingRequest;
        
        // Включить сенсор.
        Common::TurnOnSensorSwitch();
        
        while (true)
        {
            // Спим пока не поступит запрос на открытие клапана.
            ulTaskNotifyTake(pdTRUE, /* Clear the notification value before exiting. */ portMAX_DELAY);
            
            // PS. Текущий поток может устанавливать ТОЛЬКО значение false этому флагу.
            m_stopRequired = false;
                
            // Нельзя набирать воду если включен автомат нагревателя из-за вероятности ложного срабатывания.
            if(!Common::CircuitBreakerIsOn())
            {
                if (m_openValveAllowed == ValveTask::PendingForceOpen)
                {
                    // Включить воду.
                    Common::OpenValve();	
                        
                    // Ожидаем достижение порогового уровня воды или ручной остановки.
                    while (!m_stopRequired)
                    {
                        taskYIELD();
                    }
                }
                else
                {
                    if (g_waterLevelTask.GetIsInitialized())
                    {
                        uint8_t water_percent = g_waterLevelTask.Percent;
                
                        // Если уровень воды меньше уровень автоматического отключения.
                        if(water_percent < g_properties.WaterValveCutOffPercent)
                        {					
                            // Включить воду.
                            Common::OpenValve();	
                        
                            // Ожидаем достижение порогового уровня воды или ручной остановки.
                            while(!m_stopRequired && g_waterLevelTask.Percent < g_properties.WaterValveCutOffPercent)
                            {
                                taskYIELD();
                            }
                        }
                    }
                }
            }
                
            // Закрываем клапан с небольшой паузой. Здесь получаем дополнительный эффект — гистерезис или антидребезг от повторных включений.
            CloseValve();

            // Разрешить следующий запрос на открытие клапана.
            // PS. Текущий поток может устанавливать ТОЛЬКО значение WaitingRequest этому флагу.
            m_openValveAllowed = ValveTask::WaitingRequest;
        }
    }
    
    // Вызывается когда пользователь нажимает на кнопку или на сенсорную панель.
    void TryOpenValve()
    {
        if (m_openValveAllowed == ValveTask::WaitingRequest)
        {
            // Запрещаем пользователю повторные запросы.
            m_openValveAllowed = ValveTask::PendingOpen;
            
            // Пробуждаем поток.
            xTaskNotifyGive(m_taskHandle);
        }
    }
};

extern ValveTask g_valveTask;
